#FLOYD.PY file για την bonus ασκηση 

distance_graph = [ #Ο γραφος αποστασεων που προκειπτει απο το προβλημα της Ελενης-Μαριας, ειναι ενας πινακας με 5 γραμμες και 5 στηλες αφου εχουμε 5 μεταβλητες (X_0 εως X_4)
    [0 , 10 , 50 , 60 , 65 ], #Οπου υπαρχει αρχικος περιορισμος τοτε βαζουμε το δεξι μερος της ανισωσης αλλιως το σχηματιζουμε τις διαφορες μεσω των ανισωσεων που προεκιψαν απο την διαδοση περιορισμων 
    [0 , 0 , 40 , 60 , 65 ], #Το στοιχειο [i,j] του πινακα αντιστοιχει στο αριστερο μελος της ανισωσης  X_j - X_i
    [-30 , -30 , 0 , 30 , 15 ], #Για παραδειγμα το στοιχειο [0][1] ειναι το X_1 - X_0 το οποιο γνωριζουμε απο τους περιορισμους τους προβληματος(που τους εχω γραψει στο pdf) οτι ειναι <=10
    [-30 , -20 , 20 , 0 , 15 ],#Εαν δεν υπαρχει αρχικος περιορισμος που να συνδεει τις μεταβλητες X_i , X_j τοτε στην θεση [i][j] βαζουμε το δεξι μελος της ανισωσης την οποια εχουμε σχηματισει μεσω πραξεων μεταξυ των ανισωτητων που προεκιψαν για καθε μεταβλητη ξεχωριστα μεσω της διαδοσης περιορισμων που καναμε στο ερωτημα 1(που βρισκεται στο pdf)
    [-45 , -35 , -15 , -5 , 0 ],
]
#Παραθετω τους αρχικους περιορισμους για διευκολυνση :
# 0 <= X_1 - X_0 <= 10
# 30 <= X_2 - X_1 <= 40
# 5 <= X_4 - X_3 <= 15
# 15 <= X_4 - X_2 <= 15

#Ανισωτητες για καθε μεταβλητη που προεκιψαν μεσω της διαδοσης περιορισμων(τις χρησιμοποιουμε μονο οταν δεν υπαρχει καποια απο τις παρανω σχεσεις που να συνδεει τις 2 μεταβλητες):
# 0 <= X_1 <= 10
# 30 <= X_2 <= 50
# 30 <= X_3 <= 60
#45 <= X_4 <= 65 

N = 5

#Floyd Warshall Algorithm(Οπως αναγραφεται στην σελιδα 12 στο paper) 
for k in range(N):
    for i in range(N):
        for j in range(N):
            distance_graph[i][j] = min(distance_graph[i][j] , distance_graph[i][k] + distance_graph[k][j])


flag = True#
for i in range(N):
        if distance_graph[i][i] <0: #Ελεγχουμε εαν καποιο απο τα διαγωνια στοιχεια του πινακα ειναι αρνητικο που σημαινει οτι το προβλημα δεν ειναι συνεπες αφου εχουμε αρνητικο κυκλο
            flag = False
            break

for i in range(N):#Τυπωνουμε τον dgraph 
    print(distance_graph[i])
print()

if flag:#Εαν ειναι συνεπες
    print("The STP is consistent!")
    print("The solution is:" , distance_graph[0]) #Τυπωνουμε μια λυση του προβληματος ,εδω περα την πρωτη γραμμη του distance_graph 
else:#Εαν δεν ειναι συνεπες
     print("The STP is inconsistent , because from the Theorem 3.1 a negative cycle exists(a diagonal element is negative)") 
